{
  "auth": {
    "title": "Authentication",
    "signIn": "Sign In",
    "signOut": "Sign Out",
    "email": "Email",
    "password": "Password",
    "appName": "Budget App",
    "description": "Add income, planned expenses and goals to manage your family budget. Simple and effective.",
    "signInWithGoogle": "Sign in with Google",
    "signInWithGoogleAriaLabel": "Sign in with Google",
    "signingIn": "Signing you in…"
  },
  "income": {
    "title": "Income",
    "addIncome": "Add Income",
    "totalIncome": "Total Income"
  },
  "expenses": {
    "title": "Expenses",
    "addExpense": "Add Expense",
    "totalExpenses": "Total Expenses"
  },
  "goals": {
    "title": "Goals",
    "addGoal": "Add Goal",
    "myGoals": "My Goals"
  },
  "settings": {
    "title": "Settings",
    "language": "Language",
    "theme": "Theme",
    "currency": "Currency"
  },
  "docs": {
    "title": "Documentation",
    "header": {
      "title": "How does it work?",
      "subtitle": "What is the envelope method?",
      "description": "Imagine you have several envelopes, and you put money in each one for specific purposes: groceries, entertainment, transportation. The envelope method works exactly like that — you decide in advance how much you'll spend on each category and stick to that plan. This helps you avoid spending more than planned and always know how much money is left for this or that goal. Simple, clear, and very effective!"
    },
    "alwaysAvailable": {
      "title": "Always at hand",
      "description": "The app is your digital envelopes that are always with you. Open the app at any time and immediately see how much money you have, where it's going, and how much is left for your goals. No need to keep notes in a notebook or remember numbers — everything is stored in the cloud and accessible from your phone, tablet, or computer. Your budget is always in view!"
    },
    "whatAppDoes": {
      "title": "What can the app do?",
      "item1": {
        "title": "Working with different currencies",
        "description": "Getting paid in dollars but spending in rubles? No problem! Add income and expenses in any currency, and the app will automatically convert everything to one currency so you can see the big picture."
      },
      "item2": {
        "title": "Comparing options",
        "description": "Want to understand if it's better to take a loan or save up? Create several budget scenarios and compare them. This way you'll immediately see which option is better for your wallet."
      },
      "item3": {
        "title": "Automatic calculation",
        "description": "The app will show your savings, even if they are in different currencies. Just add the information."
      },
      "item4": {
        "title": "Progress toward goals",
        "description": "Set a goal to save for a vacation or a new car? The app will show how much you've already saved and how much is left. You'll always see how close you are to your goal."
      }
    }
  },
  "notFound": {
    "title": "Page Not Found",
    "message": "The requested page does not exist"
  }
}

